import React from "react";

export class Content extends React.Component{
    constructor(props) {
        super(props);
        this.state={backgroundColor: "#def1c8"};
    }
    render() {
        return(<>
            <p>КПІ ім. Ігоря Сікорського</p>
            <h3>Хоббі:</h3>
            <ul>
                <li>каліграфія</li>
                <li>волейбол</li>
                <li>піші прогулянки</li>
                <li>різьба по дереву</li>
                <li>читання книг</li>
            </ul>
            <h3>Улюблені фільми:</h3>
            <ol><i>
                <li>Гаррі Поттер</li>
                <li>Аватар</li>
                <li>Матриця</li>
                <li>Володар перстнів</li>
                <li>Один вдома</li>
                <li>Гра в імітацію</li>
                <li>Хрещений батько</li>
                <li>Кримінальне чтиво</li></i>
            </ol>
            <h4>Гонконг - суміш заходу та сходу, азіатський мегаполіс з міжнародним характером.</h4>
            <p>Гонконг це не місто і не країна, а спеціальний адміністративний регіон Китаю.</p>
            <p>Понад 150 років Гонконг був британською колонією. З 1997 року воно вже не британське місто, але ще й не зовсім китайське. Наразі триває перехідний період.</p>
            <p>До 2047 року Гонконг існуватиме за принципом «одна країна – дві системи».</p>
            <p>Тут є своя валюта, економіка, податкова система, міграційний режим. Правова система британська, а за зовнішню політику та оборону відповідає вже Китай.</p>
            </>);
    }
}

